//PSパッドのキー定義(data[]の並びは受信のソースに準ずる）


/******data[2](十字キーとスタート・セレクト・Ｌ３・Ｒ３が格納)******/

//マスク
#define KEY_MASK 0xf0
#define OPTION_MASK 0x0f

//十字キー
#define UP 0x10
#define DOWN 0x40
#define LEFT 0x80
#define RIGHT 0x20

//その他のキー(OPTIONキーと勝手に命名） 
#define SELECT 0x01
#define START 0x08
#define L3 0x02
#define R3 0x04

/******************************************************************/

/***************data[3](□  ×  ○  △  R1  L1  R2  L2)************/ 

//マスク
#define BT_MASK 0xf0
#define TRIGGER_MASK 0x0f

//○×△□
#define CIR 0x20		//○（Circle)
#define CRO 0x40		//× (Cross)
#define SQU 0x80		//□ (Square)
#define TRI 0x10		//△ (Triangle)

//トリガーボタン
#define L1 0x04
#define L2 0x01
#define R1 0x08
#define R2 0x02

/******************************************************************/




/*　ボタンとビットの対応表

・ＳＣＰＨ－１１１０

	アナログジョイスティック（デジタル/アナログモード）
	+----------+----+----+----+----+----+----+----+----+
	|  バイト  | b7 | b6 | b5 | b4 | b3 | b2 | b1 | b0 |
	+==========+====+====+====+====+====+====+====+====+
	|data[-]   |               -----                   |  不定でよい
	+----------+---------------------------------------+
	|data[0]   |   0x41(デジタル）  0x53(アナログ)     |
	+----------+---------------------------------------+
	|data[1]   |                0x5a                   | 'Z'
	+----------+----+----+----+----+----+----+----+----+
	|data[2]   | 左 | 下 | 右 | 上 |ｽﾀｰﾄ| R3 | L3 |ｾﾚｸﾄ|
	+----------+----+----+----+----+----+----+----+----+
	|data[3]   | □ | × | ○ | △ | R1 | L1 | R2 | L2 |
	+----------+----+----+----+----+----+----+----+----+
	|data[4]   | 右ﾊﾝﾄﾞﾙ  左右  左:00h,中心:80h,右:FFh |
	+----------+---------------------------------------+
	|data[5]   | 右ﾊﾝﾄﾞﾙ  上下  上:00h,中心:80h,下:FFh |
	+----------+---------------------------------------+
	|data[6]   | 左ﾊﾝﾄﾞﾙ  左右  左:00h,中心:80h,右:FFh |
	+----------+---------------------------------------+
	|data[7]   | 左ﾊﾝﾄﾞﾙ  上下  上:00h,中心:80h,下:FFh |
	+----------+---------------------------------------+
	注）アナログの中心値はある程度の誤差があるので、しきい値を設定すること。
	
*/
